Ran Plan for project: `animeutopia-prod` dir: `accounts/animeutopia-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_apigatewayv2_api_mapping.ann_mapping will be created
+ resource "aws_apigatewayv2_api_mapping" "ann_mapping" {
      + api_id      = "rhq8o3urm2"
      + domain_name = (known after apply)
      + id          = (known after apply)
      + stage       = "$default"
    }

  # aws_apigatewayv2_domain_name.ann_domain will be created
+ resource "aws_apigatewayv2_domain_name" "ann_domain" {
      + api_mapping_selection_expression = (known after apply)
      + arn                              = (known after apply)
      + domain_name                      = "rss.sheanime.com"
      + id                               = (known after apply)
      + tags_all                         = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "project"
        }

      + domain_name_configuration {
          + certificate_arn                        = "arn:aws:acm:us-east-2:481665084477:certificate/7c5671c0-4d41-4f79-b2a8-97cd47d94efb"
          + endpoint_type                          = "REGIONAL"
          + hosted_zone_id                         = (known after apply)
          + ip_address_type                        = (known after apply)
          + ownership_verification_certificate_arn = (known after apply)
          + security_policy                        = "TLS_1_2"
          + target_domain_name                     = (known after apply)
        }
    }

  # aws_lambda_function.fetch_data will be updated in-place
~ resource "aws_lambda_function" "fetch_data" {
        id                             = "fetch_data"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "ANIME_FEED_URL" = "https://rhq8o3urm2.execute-api.us-east-2.amazonaws.com/newsroom/rss.xml" -> "https://rss.sheanime.com/newsroom/rss.xml"
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p animeutopia-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fanimeutopia-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p animeutopia-prod
  ```
Plan: 2 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```